In [4]:
import pandas as pd

In [7]:
data1 = {"Name":["yash","rohit","ravi","vijay"],"AGE":[21,21,21,20],"degree":["bsc","bsc","bsc","bsc"]}

In [8]:
data1

{'Name': ['yash', 'rohit', 'ravi', 'vijay'],
 'AGE': [21, 21, 21, 20],
 'degree': ['bsc', 'bsc', 'bsc', 'bsc']}

In [9]:
df=pd.DataFrame(data=data1)

In [10]:
df

    Name  AGE degree
0   yash   21    bsc
1  rohit   21    bsc
2   ravi   21    bsc
3  vijay   20    bsc

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
x=df["Name"]

In [13]:
x

0     yash
1    rohit
2     ravi
3    vijay
Name: Name, dtype: object

In [14]:
type(x)

pandas.core.series.Series

In [19]:
ages=pd.Series([2,8,10,12],name="age")

In [20]:
ages

0     2
1     8
2    10
3    12
Name: age, dtype: int64

In [21]:
data1

{'Name': ['yash', 'rohit', 'ravi', 'vijay'],
 'AGE': [21, 21, 21, 20],
 'degree': ['bsc', 'bsc', 'bsc', 'bsc']}

In [22]:
df

    Name  AGE degree
0   yash   21    bsc
1  rohit   21    bsc
2   ravi   21    bsc
3  vijay   20    bsc

In [24]:
y=df["AGE"]

In [25]:
y.max()

21

In [26]:
y.min()

20

In [29]:
y.mean()

20.75

In [30]:
df["AGE"].max()

21

In [31]:
ages=pd.Series([2,8,10,12],name="age")

In [32]:
ages.max()

12

In [33]:
df.describe()

         AGE
count   4.00
mean   20.75
std     0.50
min    20.00
25%    20.75
50%    21.00
75%    21.00
max    21.00

In [ ]:
'''describe gives a quick overview of numerical dataframe'''

In [34]:
dataset={"country" : ["Brazil", "Russia", "India", "China", "South Africa"],
"capital" : ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area" : [8.516, 17.10, 3.286, 9.67, 2.98],
"population" : [200.4, 143.5, 1252, 133, 4.3]}

In [35]:
df=pd.DataFrame(data=dataset)

In [36]:
df

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [41]:
x=pd.Series([8.516, 17.10, 3.286, 9.67, 2.98],name="area")

In [38]:
df.describe()

            area   population
count   5.000000     5.000000
mean    8.310400   346.640000
std     5.762066   511.167158
min     2.980000     4.300000
25%     3.286000   133.000000
50%     8.516000   143.500000
75%     9.670000   200.400000
max    17.100000  1252.000000

In [42]:
x.describe()

count     5.000000
mean      8.310400
std       5.762066
min       2.980000
25%       3.286000
50%       8.516000
75%       9.670000
max      17.100000
Name: area, dtype: float64

In [43]:
dataset

{'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
 'capital': ['Brasilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
 'area': [8.516, 17.1, 3.286, 9.67, 2.98],
 'population': [200.4, 143.5, 1252, 133, 4.3]}

In [45]:
df

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [46]:
df.shape

(5, 4)

In [ ]:
'''shape is used to give prop no need to give arguments.'''

In [47]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [48]:
df.index = ['A','B','C','D','E']

In [49]:
df

        country    capital    area  population
A        Brazil   Brasilia   8.516       200.4
B        Russia     Moscow  17.100       143.5
C         India  New Delhi   3.286      1252.0
D         China    Beijing   9.670       133.0
E  South Africa   Pretoria   2.980         4.3

In [69]:
df.index=range(2,12,2)

In [70]:
df

         country    capital    area  population
2         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
6          India  New Delhi   3.286      1252.0
8          China    Beijing   9.670       133.0
10  South Africa   Pretoria   2.980         4.3